Revit 2018 API
Application.IsSubscriptionUpdate Property
 True if this version of Revit is a subscription update.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2015 Subscription Update
Syntax
C#
[ObsoleteAttribute("This property is deprecated in Revit 2018 and will be removed in the next version of Revit. We suggest you use the SubVersionNumber property instead.")]
public bool IsSubscriptionUpdate { get; }
Visual Basic
<ObsoleteAttribute("This property is deprecated in Revit 2018 and will be removed in the next version of Revit. We suggest you use the SubVersionNumber property instead.")> _
Public ReadOnly Property IsSubscriptionUpdate As Boolean
	Get
Visual C++
[ObsoleteAttribute(L"This property is deprecated in Revit 2018 and will be removed in the next version of Revit. We suggest you use the SubVersionNumber property instead.")]
public:
property bool IsSubscriptionUpdate {
	bool get ();
}
Remarks
 Subscription update releases may have additional APIs and functionality not available in the standard customer releases. Add-ins written to support standard Revit releases should be compatible with subscription updates, but add-ins written specifically targeting new features in subscription updates would not be compatible with the standard releases.
See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace